NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAMA5D35.svd
        <register>
          <name>CIDR</name>
          <description>Chip ID Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version of the Device</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPROC</name>
              <description>Embedded Processor</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM946ES</name>
                  <description>ARM946ES</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM7TDMI</name>
                  <description>ARM7TDMI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM3</name>
                  <description>Cortex-M3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM920T</name>
                  <description>ARM920T</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM926EJS</name>
                  <description>ARM926EJS</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA5</name>
                  <description>Cortex-A5</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVPSIZ</name>
              <description>Nonvolatile Program Memory Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <description>8K bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16K bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>32K bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K</name>
                  <description>64K bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128K</name>
                  <description>128K bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256K</name>
                  <description>256K bytes</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <description>512K bytes</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024K</name>
                  <description>1024K bytes</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048K</name>
                  <description>2048K bytes</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVPSIZ2</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <description>8K bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16K bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>32K bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K</name>
                  <description>64K bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128K</name>
                  <description>128K bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256K</name>
                  <description>256K bytes</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <description>512K bytes</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024K</name>
                  <description>1024K bytes</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048K</name>
                  <description>2048K bytes</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMSIZ</name>
              <description>Internal SRAM Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1K</name>
                  <description>1K bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2K</name>
                  <description>2K bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6K</name>
                  <description>6K bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>112K</name>
                  <description>112K bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4K</name>
                  <description>4K bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80K</name>
                  <description>80K bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>160K</name>
                  <description>160K bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <description>8K bytes</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16K bytes</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>32K bytes</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K</name>
                  <description>64K bytes</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128K</name>
                  <description>128K bytes</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256K</name>
                  <description>256K bytes</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>96K</name>
                  <description>96K bytes</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <description>512K bytes</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARCH</name>
              <description>Architecture Identifier</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AT91SAM9xx</name>
                  <description>AT91SAM9xx Series</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM9XExx</name>
                  <description>AT91SAM9XExx Series</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91x34</name>
                  <description>AT91x34 Series</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP7</name>
                  <description>CAP7 Series</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP9</name>
                  <description>CAP9 Series</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP11</name>
                  <description>CAP11 Series</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91x40</name>
                  <description>AT91x40 Series</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91x42</name>
                  <description>AT91x42 Series</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91x55</name>
                  <description>AT91x55 Series</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM7Axx</name>
                  <description>AT91SAM7Axx Series</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM7AQxx</name>
                  <description>AT91SAM7AQxx Series</description>
                  <value>0x61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91x63</name>
                  <description>AT91x63 Series</description>
                  <value>0x63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM7Sxx</name>
                  <description>AT91SAM7Sxx Series</description>
                  <value>0x70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM7XCxx</name>
                  <description>AT91SAM7XCxx Series</description>
                  <value>0x71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM7SExx</name>
                  <description>AT91SAM7SExx Series</description>
                  <value>0x72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM7Lxx</name>
                  <description>AT91SAM7Lxx Series</description>
                  <value>0x73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM7Xxx</name>
                  <description>AT91SAM7Xxx Series</description>
                  <value>0x75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91SAM7SLxx</name>
                  <description>AT91SAM7SLxx Series</description>
                  <value>0x76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3UxC</name>
                  <description>ATSAM3UxC Series (100-pin version)</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3UxE</name>
                  <description>ATSAM3UxE Series (144-pin version)</description>
                  <value>0x81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3AxC</name>
                  <description>ATSAM3AxC Series (100-pin version)</description>
                  <value>0x83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3XxC</name>
                  <description>ATSAM3XxC Series (100-pin version)</description>
                  <value>0x84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3XxE</name>
                  <description>ATSAM3XxE Series (144-pin version)</description>
                  <value>0x85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3XxG</name>
                  <description>ATSAM3XxG Series (208/217-pin version)</description>
                  <value>0x86</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3SxA</name>
                  <description>ATSAM3SxA Series (48-pin version)</description>
                  <value>0x88</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3SxB</name>
                  <description>ATSAM3SxB Series (64-pin version)</description>
                  <value>0x89</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3SxC</name>
                  <description>ATSAM3SxC Series (100-pin version)</description>
                  <value>0x8A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT91x92</name>
                  <description>AT91x92 Series</description>
                  <value>0x92</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3NxA</name>
                  <description>ATSAM3NxA Series (48-pin version)</description>
                  <value>0x93</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3NxB</name>
                  <description>ATSAM3NxB Series (64-pin version)</description>
                  <value>0x94</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3NxC</name>
                  <description>ATSAM3NxC Series (100-pin version)</description>
                  <value>0x95</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3SDxA</name>
                  <description>ATSAM3SDxA Series (48-pin version)</description>
                  <value>0x98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3SDxB</name>
                  <description>ATSAM3SDxB Series (64-pin version)</description>
                  <value>0x99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATSAM3SDxC</name>
                  <description>ATSAM3SDxC Series (100-pin version)</description>
                  <value>0x9A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AT75Cxx</name>
                  <description>AT75Cxx Series</description>
                  <value>0xF0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVPTYP</name>
              <description>Nonvolatile Program Memory Type</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROM</name>
                  <description>ROM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROMLESS</name>
                  <description>ROMless or on-chip Flash</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>Embedded Flash Memory</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROM_FLASH</name>
                  <description>ROM and Embedded Flash MemoryNVPSIZ is ROM size      NVPSIZ2 is Flash size</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM</name>
                  <description>SRAM emulating ROM</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT</name>
              <description>Extension Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXID</name>
          <description>Chip ID Extension Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EXID</name>
              <description>Chip ID Extension</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FNR</name>
          <description>Force NTRST Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FNTRST</name>
              <description>Force NTRST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
